In [1]:
import pandas as pd
import numpy as np

#Statistic
from scipy import stats

import plotly.express as px
import matplotlib.pyplot as plt

# Dataframe

In [2]:
df=pd.read_csv("C:\\Users\\Saravanan\\OneDrive\\Desktop\\Datasets_data\\job_placement.csv")

In [3]:
df

,id,name,gender,age,degree,stream,college_name,placement_status,salary,gpa,years_of_experience
0,1,John Doe,Male,25,Bachelor's,Computer Science,Harvard University,Placed,60000,3.7,2.0
1,2,Jane Smith,Female,24,Bachelor's,Electrical Engineering,Massachusetts Institute of Technology,Placed,65000,3.6,1.0
2,3,Michael Johnson,Male,26,Bachelor's,Mechanical Engineering,Stanford University,Placed,58000,3.8,3.0
3,4,Emily Davis,Female,23,Bachelor's,Information Technology,Yale University,Not Placed,0,3.5,2.0
4,5,David Brown,Male,24,Bachelor's,Computer Science,Princeton University,Placed,62000,3.9,2.0
...,...,...,...,...,...,...,...,...,...,...,...
695,696,Lucas Taylor,Male,23,Bachelor's,Computer Science,University of Washington,Placed,67000,3.8,3.0
696,697,Emma Martinez,Female,26,Bachelor's,Electronics and Communication,University of California--Berkeley,Placed,66000,3.9,3.0
697,698,Aiden Davis,Male,24,Bachelor's,Computer Science,University of Illinois--Urbana-Champaign,Placed,65000,3.8,3.0
698,699,Mia Wilson,Female,23,Bachelor's,Electrical Engineering,University of Colorado--Boulder,Placed,66000,3.7,2.0
699,700,Jack Garcia,Male,26,Bachelor's,Information Technology,University of North Carolina--Chapel Hill,Not Placed,0,3.6,1.0

# Observation

Unsupervised

In [4]:
df['years_of_experience'].unique()

array([ 2.,  1.,  3., nan])

In [ ]:
continous_column=['salar']
catagory_column=['gender', 'age', 'stream', 'college_name', 'placement_status', 'gpa', 'years_of_experience']

# Data Cleaning

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 700 entries, 0 to 699
Data columns (total 11 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   id                   700 non-null    int64
 1   name                 700 non-null    object
 2   gender               700 non-null    object
 3   age                  700 non-null    int64
 4   degree               700 non-null    object
 5   stream               700 non-null    object
 6   college_name         700 non-null    object
 7   placement_status     700 non-null    object
 8   salary               700 non-null    int64
 9   gpa                  700 non-null    float64
 10  years_of_experience  699 non-null    float64
dtypes: float64(2), int64(3), object(6)
memory usage: 60.3+ KB

In [6]:
df.set_index('id',inplace=True)

In [8]:
df.drop(['name','gender'],axis=1,inplace=True)

In [9]:
df

,age,degree,stream,college_name,placement_status,salary,gpa,years_of_experience
id,,,,,,,,
1,25,Bachelor's,Computer Science,Harvard University,Placed,60000,3.7,2.0
2,24,Bachelor's,Electrical Engineering,Massachusetts Institute of Technology,Placed,65000,3.6,1.0
3,26,Bachelor's,Mechanical Engineering,Stanford University,Placed,58000,3.8,3.0
4,23,Bachelor's,Information Technology,Yale University,Not Placed,0,3.5,2.0
5,24,Bachelor's,Computer Science,Princeton University,Placed,62000,3.9,2.0
...,...,...,...,...,...,...,...,...
696,23,Bachelor's,Computer Science,University of Washington,Placed,67000,3.8,3.0
697,26,Bachelor's,Electronics and Communication,University of California--Berkeley,Placed,66000,3.9,3.0
698,24,Bachelor's,Computer Science,University of Illinois--Urbana-Champaign,Placed,65000,3.8,3.0
699,23,Bachelor's,Electrical Engineering,University of Colorado--Boulder,Placed,66000,3.7,2.0
700,26,Bachelor's,Information Technology,University of North Carolina--Chapel Hill,Not Placed,0,3.6,1.0

In [10]:
df.isnull().sum()

age                    0
degree                 0
stream                 0
college_name           0
placement_status       0
salary                 0
gpa                    0
years_of_experience    1
dtype: int64

In [11]:
df.years_of_experience.fillna(0,inplace=True)

C:\Users\Saravanan\AppData\Local\Temp\ipykernel_10680\4290773350.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df.years_of_experience.fillna(0,inplace=True)

In [14]:
df.isnull().sum()

age                    0
degree                 0
stream                 0
college_name           0
placement_status       0
salary                 0
gpa                    0
years_of_experience    0
dtype: int64

In [15]:
df.duplicated().sum()

438

In [16]:
df.drop_duplicates(inplace=True)

In [17]:
df.duplicated().sum()

0

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 262 entries, 1 to 545
Data columns (total 8 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   age                  262 non-null    int64
 1   degree               262 non-null    object
 2   stream               262 non-null    object
 3   college_name         262 non-null    object
 4   placement_status     262 non-null    object
 5   salary               262 non-null    int64
 6   gpa                  262 non-null    float64
 7   years_of_experience  262 non-null    float64
dtypes: float64(2), int64(2), object(4)
memory usage: 18.4+ KB

In [19]:
df.head()

,age,degree,stream,college_name,placement_status,salary,gpa,years_of_experience
id,,,,,,,,
1,25,Bachelor's,Computer Science,Harvard University,Placed,60000,3.7,2.0
2,24,Bachelor's,Electrical Engineering,Massachusetts Institute of Technology,Placed,65000,3.6,1.0
3,26,Bachelor's,Mechanical Engineering,Stanford University,Placed,58000,3.8,3.0
4,23,Bachelor's,Information Technology,Yale University,Not Placed,0,3.5,2.0
5,24,Bachelor's,Computer Science,Princeton University,Placed,62000,3.9,2.0